/*
Составить программу вычисления объема цилиндра и конуса, которые имеют одинаковую высоту h 
и одинаковый радиус основания r.

Входные данные:
Два натуральных числа. Первое 
r - радиус основания в см, второе h - высота в сантиметрах.

Выходные данные:
Два вещественных числа, записанные через пробел и имеющих два знака после запятой. 
Первое число - объём цилиндра с высотой h и радиусом основания r. 
Второе число - объём конуса с высотой h и радиусом основания r.

Справка:
Для числа π используйте значение 3.14159265358979323846

Sample Input:
11 29

Sample Output:
11023.85 3674.62
*/

#include <stdio.h>

int main() {
  // put your code here
    int r, h;
    double pi = 3.14159265358979323846;
    scanf("%d %d", &r, &h);
    printf("%.2f %.2f", pi * r * r * h, 1.0 / 3.0 * pi * r * r * h);
    
    return 0;
}
