/*
Напишите программу переводящую угол из градусной меры в радианную.

Формат входных данных:

Одно целое число A — угол, измеренный в градусах.

Формат выходных данных:

Вещественное число R — угол, измеренный в радианах. Точность — два знака после запятой.

Указание:

Для числа 𝜋 использовать следующее значение 𝜋 = 3.1415926

Sample Input:
90

Sample Output:
1.57
*/

#include <stdio.h>

int main() {
    // put your code here
    double pi = 3.1415926;
    int degree;
    scanf("%d", &degree);
    printf("%.2lf", degree / (180 / pi));
    
    return 0;
}
