/*
Написать программу, вычисляющую площадь треугольника по двум сторонам и углу между ними.

Формат входных данных:
На вход программы поступают три числа a,b,γ.
a,b — вещественные числа, длины сторон треугольника.
γ — угол между сторонами 
a и b, записанный в градусах, вещественное число.

Формат выходных данных:
Одно число -- площадь треугольника со сторонами 
a,b и углом γ. Точность — два знака после запятой.

Число π считать равным 3.141593.

Sample Input:
17.77 18.31 168.87

Sample Output:
31.40
*/

#include <stdio.h>
#include <math.h>

int main() {
  // put your code here
  double a, b, degree, pi = 3.141593;
  scanf("%lf %lf %lf", &a, &b, &degree);
  double S = 0.5 * a * b * sin(degree * pi / 180.0);
  printf("%.2f", S);
    
  return 0;
}
